In [1]:
import pandas as pd

In [68]:
data = pd.read_csv('checkins.csv',sep='\s+\|',engine='python')

In [69]:
data.head()

,id,user_id,venue_id,latitude,longitude,created_at
0,984301,2041916.0,5222.0,NaN,NaN,2012-04-21 17:39:01
1,984222,15824.0,5222.0,38.895112,-77.036366,2012-04-21 17:43:47
2,984315,1764391.0,5222.0,NaN,NaN,2012-04-21 17:37:18
3,984234,44652.0,5222.0,33.800745,-84.410520,2012-04-21 17:43:43
4,984249,2146840.0,5222.0,NaN,NaN,2012-04-21 17:42:58

In [77]:
data.dropna(axis=0,inplace=True)

In [78]:
data.head()

,id,user_id,venue_id,latitude,longitude,created_at
1,984222,15824.0,5222.0,38.895112,-77.036366,2012-04-21 17:43:47
3,984234,44652.0,5222.0,33.800745,-84.410520,2012-04-21 17:43:43
7,984291,105054.0,5222.0,45.523452,-122.676207,2012-04-21 17:39:22
9,984318,2146539.0,5222.0,40.764462,-111.904565,2012-04-21 17:35:46
10,984232,93870.0,380645.0,33.448377,-112.074037,2012-04-21 17:38:18

In [80]:
from sklearn import cluster

In [85]:
ms = cluster.MeanShift(bandwidth=0.1)
ms.fit(data.iloc[range(100000),[3,4]])

MeanShift(bandwidth=0.1, bin_seeding=False, cluster_all=True, min_bin_freq=1,
     n_jobs=1, seeds=None)

In [93]:
?cluster.MeanShift()

In [96]:
ms.cluster_centers_.shape

(3230, 2)

In [97]:
import numpy as np
labels = np.unique(ms.labels_)
print labels

[   0    1    2 ..., 3227 3228 3229]

In [98]:
important_labels = []
for i in labels:
    k = 0
    for j in ms.labels_:
        if j == i:
            k+=1
    if k>15:
        important_labels.append(i)

In [109]:
offices = [ [33.751277, -118.188740], [25.867736, -80.324116], [51.503016, -0.075479], \
           [52.378894, 4.885084], [39.366487, 117.036146] ,[-33.868457, 151.205134] ]

In [111]:
distances = []
for i in important_labels:
    dist = 1000000000
    for j in offices:
        d = np.linalg.norm(np.array(ms.cluster_centers_[i])-np.array(j))
        if d < dist:
            dist = d
    distances.append(dist)

In [116]:
ans = ms.cluster_centers_[important_labels[distances.index(min(distances))]]

In [118]:
f = open('ans','w')
f.write(str(ans[0])+' '+str(ans[1]))
f.close()